{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.1.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_inputs"}, "name": "encoder_inputs", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "encoder_embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 42], "input_dim": 25, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 42}, "name": "encoder_embedding", "inbound_nodes": [[["encoder_inputs", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 15], "dtype": "float32", "sparse": false, "ragged": false, "name": "decoder_inputs"}, "name": "decoder_inputs", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "encoder_lstm", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 8, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 4}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 5}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 6}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "encoder_lstm", "inbound_nodes": [[["encoder_embedding", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "decoder_lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 8, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "decoder_lstm", "inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]]}, {"class_name": "Dense", "config": {"name": "decoder_dense", "trainable": true, "dtype": "float32", "units": 15, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "decoder_dense", "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]]}], "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]], "output_layers": [["decoder_dense", 0, 0]]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.001, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": true}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "decoder_dense/kernel", "shape": [8, 15], "dtype": "float32"}, {"name": "decoder_dense/bias", "shape": [15], "dtype": "float32"}, {"name": "decoder_lstm/lstm_cell_155/kernel", "shape": [15, 32], "dtype": "float32"}, {"name": "decoder_lstm/lstm_cell_155/recurrent_kernel", "shape": [8, 32], "dtype": "float32"}, {"name": "decoder_lstm/lstm_cell_155/bias", "shape": [32], "dtype": "float32"}, {"name": "encoder_embedding/embeddings", "shape": [25, 8], "dtype": "float32"}, {"name": "encoder_lstm/lstm_cell_154/kernel", "shape": [8, 32], "dtype": "float32"}, {"name": "encoder_lstm/lstm_cell_154/recurrent_kernel", "shape": [8, 32], "dtype": "float32"}, {"name": "encoder_lstm/lstm_cell_154/bias", "shape": [32], "dtype": "float32"}]}]}